//
//  MLabels.swift
//  socialApp
//
//  Created by Денис Щиголев on 14.10.2020.
//  Copyright © 2020 Денис Щиголев. All rights reserved.
//

import Foundation

enum MLabels: String {
    case dateOfBirthHeader = "Когда у тебя день рождения?"
    case dateOfBirthSubHeader = "Мы никому не покажем дату, только отобразим твой возраст."
    case genderSelectionHeader = "Немного больше о тебе"
    case interestSelectionHeader = "Что ты ищешь?"
    case interestSelectionSubHeader = "Расскажи о своих интересах, что бы проще найти единомышленников"
    case editPhotoTips = "Необходимо опубликовать минимум одно фото, если ты застенчив либо обеспокоен приватностью, опубликуй то, что тебя представляет. Для выбора главного фото/удаления нажми на иконку изображения."
    case editPhotoLegal = "Только свои фото. Без наготы, оружия, детей (включая семейные фото), насилия любого типа. Загружая незаконный контент, мы будем вынуждены заблокировать твой аккаунт навсегда."
    case emptyNearbyPeople = "Рядом никого"
    case requestMessage = "Привет"
    case screenshotTaken = " сделал(а) скриншот чата"
    case userStopChatTimer = " хочет продолжить общение и отключил таймер удаления чата"
    case chatTimerIsStop = "Таймер удаления остановлен, чат не будет удален, приятного общения"
    case chatTimerIsStopWithPremium = " отключил таймер с помощью Flava premium. Чат не будет удален, приятного общения"
    case newRequest = "У тебя новый лайк"
    case subscriptionsAbout = "Сразу после оформления подписки Flava premium, ты увидишь кто тебя лайкнул, последнее время активности пользователей, получишь безлимитные лайки. Подписка производится с твоего Apple ID аккаунта и обновляется автоматически. Удаление приложения не отменяет подписку автоматически. Все подписки возобновляются автоматически, пока ты не отменишь их как минимум за 24 часа до истечения оплаченного периода. Плата за продление будет списываться со счета учетной записи в течение 24 часов до оконочания текущего периода с указанием стоимости продления. После приобретения подписки ты сможешь управлять ею и выключить автоматическое обновление в настройках Itunes - аккаунта"
}
